TCL4 Data Management/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-16 Tue 21:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UTM TCL4 DMP API and Data Models</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abraham K. Ishihara" />
<link rel="stylesheet" type="text/css" href="main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">UTM TCL4 DMP API and Data Models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4aac2da">1. Introduction</a></li>
<li><a href="#org23d44d8">2. API and Data Model Specification Release Schedule</a></li>
<li><a href="#org0762f92">3. API Release Schedule</a></li>
<li><a href="#orgb645fd2">4. Data Integrity in TCL4</a>
<ul>
<li><a href="#org6f2c2aa">4.1. Collaborative Simulation</a>
<ul>
<li><a href="#org50f60c1">4.1.1. Scenario 2: <code>(uss_name,call_sign)</code></a></li>
<li><a href="#orgce35077">4.1.2. Scenario 2: <code>(uvin,call_sign)</code></a></li>
<li><a href="#orgc01514d">4.1.3. Scenario 4: <code>(uss_name,call_sign)</code></a></li>
<li><a href="#orgca12a8f">4.1.4. Scenario 4: <code>(uvin,call_sign)</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4aac2da" class="outline-2">
<h2 id="org4aac2da"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the API specification and implementation <b>release schedule</b> for UTM TCL4 DMP data collection efforts.  It will be updated frequently.  The specification  and associated data models are described using OpenAPI Specification (OAS) 2.0 (<code>https://github.com/OAI/OpenAPI-Specification</code>) and can be found in the GIT repository located at
</p>
<pre class="example">
https://github.com/nasa/utm-docs/tree/master/TCL4%20Data%20Management
</pre>
</div>
</div>
<div id="outline-container-org23d44d8" class="outline-2">
<h2 id="org23d44d8"><span class="section-number-2">2</span> API and Data Model Specification Release Schedule</h2>
<div class="outline-text-2" id="text-2">
<p>
The GIT repository for the DMP API and data models is actively used by at least three parties: 
</p>
<ul class="org-ul">
<li>NUSS</li>
<li>DMP</li>
<li>External Partners</li>
</ul>
<p>
Since automated builds may directly incorporate the API and data models from the GIT repository, the following describes how changes will be conveyed and how continuous build cycles can be maintained while code is being developed to address the change.  
</p>

<p>
The master branch will be tagged with a version identifier of the form vx.y.z.  Twenty four hours prior to a change, we will announce over the <code>uss_implementers</code> channel on slack that a change is forthcoming.  We will identify the new tag and the release branch that contains the intended changes.  During this time, developers can inspect the release branch and assess the impact to their code/build cycles.  If it is determined that the change will have an adverse impact, developers can point their code to the current (stable) GIT tag idenfitier.  Our GIT branching model for both specification and code generally follows the one outlined here: <a href="https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow">https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date Announced</th>
<th scope="col" class="org-left">Review-Branch</th>
<th scope="col" class="org-left">Date Implemented</th>
<th scope="col" class="org-left">Tag on Master</th>
<th scope="col" class="org-left">Breaking</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">n/a</td>
<td class="org-left">n/a</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-14 Thu&gt;</span></span></td>
<td class="org-left">v1.0.1</td>
<td class="org-left">n/a</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-21 Thu&gt;</span></span></td>
<td class="org-left">release-v1.0.2</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-22 Fri&gt;</span></span></td>
<td class="org-left">v1.0.2</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-30 Sat&gt;</span></span></td>
<td class="org-left">release-v1.0.3</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left">v1.0.3</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-03 Wed&gt;</span></span></td>
<td class="org-left">release-v1.0.4</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-04 Thu&gt;</span></span></td>
<td class="org-left">v1.0.4</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-09 Tue&gt;</span></span></td>
<td class="org-left">release-v1.0.5</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-10 Wed&gt;</span></span></td>
<td class="org-left">v1.0.5</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-16 Tue&gt;</span></span></td>
<td class="org-left">release-v1.0.6</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-17 Wed&gt;</span></span></td>
<td class="org-left">v1.0.6</td>
<td class="org-left">yes</td>
</tr>
</tbody>
</table>
</div>
</div>
