TCL4 Data Management/main.org
* API Release Schedule
  This schedule is intended to convey to UTM TCL4 participants when NASA servers will support the various end-points described in the OpenAPI specification.  It is to be assumed that the endpoints, when released, will support the latest tag on the master branch.    
  | Endpoint                             | Location                          | status      | POC | Sprint           | Release Date     |
  |--------------------------------------+-----------------------------------+-------------+-----+------------------+------------------|
  | /uss-exchange                        | utm-tcl4-dmp-api.yaml             | done        | AF  | <2019-03-25 Mon> | <2019-03-28 Thu> |
  | /uss-handoff                         | utm-tcl4-dmp-api.yaml             | done        | AF  | <2019-03-25 Mon> | <2019-03-28 Thu> |
  | /uss-negotiation                     | utm-tcl4-dmp-api.yaml             | done        | SL  | <2019-03-25 Mon> | <2019-04-04 Thu> |
  | /uss-2-operator-exchange             | utm-tcl4-dmp-api.yaml             | done        | SL  | <2019-03-25 Mon> | <2019-04-04 Thu> |
  | /dynamic-restriction-occurrence      | utm-tcl4-dmp-api.yaml             | done        | SL  | <2019-04-01 Mon> | <2019-04-11 Thu> |
  | /fet                                 | utm-tcl4-dmp-fet-api.yaml         | done        | DS  | <2019-04-01 Mon> | <2019-04-11 Thu> |
  | /fet-latency                         | utm-tcl4-dmp-fet-latency-api.yaml | done        | DS  | <2019-04-01 Mon> | <2019-04-11 Thu> |
  | /off-nominal                         | utm-tcl4-dmp-api.yaml             | done        | AF  | <2019-04-01 Mon> | <2019-04-17 Wed> |
  | /loss-of-uss                         | utm-tcl4-dmp-api.yaml             | done        | AF  | <2019-04-01 Mon> | <2019-04-17 Wed> |
  | /cns-pre-run                         | utm-tcl4-dmp-cns-api.yaml         | in progress | AF  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-rpic-constraint-message         | utm-tcl4-dmp-con-api.yaml         | in progress | SL  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-pre-run-range                   | utm-tcl4-dmp-con-api.yaml         |             | AF  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-pre-run-op                      | utm-tcl4-dmp-con-api.yaml         |             | AF  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-actual-landing                  | utm-tcl4-dmp-con-api.yaml         |             | SL  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-wx-operating-point-data         | utm-tcl4-dmp-con-api.yaml         | in progress | DS  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-wx-operating-point-data-station | utm-tcl4-dmp-con-api.yaml         |             | DS  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-cell-service-availability       | utm-tcl4-dmp-con-api.yaml         |             | SL  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /con-distress-v2v                    | utm-tcl4-dmp-con-api.yaml         |             | DS  | <2019-04-15 Mon> | <2019-04-25 Thu> |
  | /aux-ops                             | TBD                               |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-uas-truth-position              | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-uas-truth-ecef-coordinate       | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-emergency-phase                 | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-off-nominal-mitigation-outcome  | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-landing-outcome                 | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-safe-to-land-location-reach     | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /cns-onboard-safe-landing-capability | utm-tcl4-dmp-cns-api.yaml         |             |     | <2019-04-22 Mon> | <2019-05-02 Thu> |
  | /daa - tbd                           | utm-tcl4-dmp-daa-api.yaml         |             |     | <2019-04-29 Mon> | <2019-05-09 Thu> |
