TCL4 Data Management/main.html


<div id="outline-container-org0762f92" class="outline-2">
<h2 id="org0762f92"><span class="section-number-2">3</span> API Release Schedule</h2>
<div class="outline-text-2" id="text-3">
<p>
This schedule is intended to convey to UTM TCL4 participants when NASA servers will support the various end-points described in the OpenAPI specification.  It is to be assumed that the endpoints, when released, will support the latest tag on the master branch.    
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Endpoint</th>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">status</th>
<th scope="col" class="org-left">POC</th>
<th scope="col" class="org-left">Sprint</th>
<th scope="col" class="org-left">Release Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/uss-exchange</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-25 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-28 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/uss-handoff</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-25 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-28 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/uss-negotiation</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-25 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-04 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/uss-2-operator-exchange</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-25 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-04 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/dynamic-restriction-occurrence</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-11 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/fet</td>
<td class="org-left">utm-tcl4-dmp-fet-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">DS</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-11 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/fet-latency</td>
<td class="org-left">utm-tcl4-dmp-fet-latency-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">DS</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-11 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/off-nominal</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-17 Wed&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/loss-of-uss</td>
<td class="org-left">utm-tcl4-dmp-api.yaml</td>
<td class="org-left">done</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-01 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-17 Wed&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-pre-run</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">in progress</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-rpic-constraint-message</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">in progress</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-pre-run-range</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-pre-run-op</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AF</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-actual-landing</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-wx-operating-point-data</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">in progress</td>
<td class="org-left">DS</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-wx-operating-point-data-station</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">DS</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-cell-service-availability</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SL</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/con-distress-v2v</td>
<td class="org-left">utm-tcl4-dmp-con-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">DS</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-15 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-25 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/aux-ops</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-uas-truth-position</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-uas-truth-ecef-coordinate</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-emergency-phase</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-off-nominal-mitigation-outcome</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-landing-outcome</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-safe-to-land-location-reach</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/cns-onboard-safe-landing-capability</td>
<td class="org-left">utm-tcl4-dmp-cns-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-22 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-02 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">/daa - tbd</td>
<td class="org-left">utm-tcl4-dmp-daa-api.yaml</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-04-29 Mon&gt;</span></span></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-05-09 Thu&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
