TCL4 Data Management/main.org
* Data Integrity in TCL4
  In order to provide data integrity for the vast amounts of data collected over the course of TCL4, we require the set of =(uss_name,call_sign)= pairs and the set of =(uvin,call_sign)= pairs to be pre-determined and immutable.  For the collaborative simulation, shakedown, and the primary demonstration, these pre-determined sets will be stated in this document and uploaded to this github directory.
** Collaborative Simulation   
   - Data can be found in the following files: 
     - =NV-CollabSim-Sc2-USSClientId-CallSign_unique.csv=
     - =NV-CollabSim-Sc2-UVIN-CallSign.csv=
     - =NV-CollabSim-Sc4-USSClientId-CallSign_unique.csv=
     - =NV-CollabSim-Sc4-UVIN-CallSign.csv=
*** Scenario 2: =(uss_name,call_sign)=   
   | =uss_name=              | =call_sign= |
   |-------------------------+-------------|
   | airxos.co               | Yoda        |
   | uber.com                | Luke        |
   | airxos.co               | HanSolo     |
   | uber.com                | DarthVader  |
   | uss.avisionrobotics.com | Jabba       |
   | airxos.co               | Wicket      |
   | airxos.co               | Leia        |
   | uber.com                | Kenobi      |
   | airxos.co               | BobaFett    |
   | uber.com                | R2-D2       |
   | uss.avisionrobotics.com | C-3PO       |
   | airxos.co               | Ackbar      |
   | airxos.co               | Emperor     |
   | uber.com                | Lando       |
   | airxos.co               | Chewie      |
   | uber.com                | Tarkin      |
   | uss.avisionrobotics.com | Greedo      |
   | airxos.co               | Sarlac      |
   | uss-dev.flyanra.net     | Grievous    |
   | uss.airmap.com          | Dooku       |
   | uss-dev.flyanra.net     | Anakin      |
   | uss.airmap.com          | DarthMaul   |
   | uss.airmap.com          | JarJar      |
   | uss.airmap.com          | Padme       |
   | uss.airmap.com          | Palpatine   |
   | uss.avisionrobotics.com | MaceWindu   |
   | uss.avisionrobotics.com | Qui-Gon     |
   | uss.avisionrobotics.com | JangoFett   |
   | uss.avisionrobotics.com | BailOrgana  |
   | uber.com                | Sebulba     |
   | uber.com                | Watto       |
   | uber.com                | Nute        |
   | uber.com                | Valorum     |
*** Scenario 2: =(uvin,call_sign)=      
    | =uvin=                               | =call_sign= |
    |--------------------------------------+-------------|
    | 155cd3bc-a70c-46ef-9020-e0c71ed4fc42 | Yoda        |
    | 0654918c-0d04-4219-805c-0b97560fc137 | Yoda        |
    | 068e2e34-d792-4c99-aab6-2631fe1987ca | Luke        |
    | 33d38948-5695-44f9-ac51-6a566b37a362 | Luke        |
    | e44db783-9059-4aba-b894-3e934498ce22 | HanSolo     |
    | c8e163e2-ddcf-4bee-a1b6-894534c21996 | HanSolo     |
    | a7fc22dc-70a7-428c-8f79-3f9ed0a7f855 | DarthVader  |
    | fcb4c8b9-b384-4e27-8624-aebaf13d68bf | DarthVader  |
    | d378764f-63b5-4ee9-8413-c03b0de4281f | Jabba       |
    | 47d996ea-f7e1-4ec5-ae3f-055dd8938101 | Wicket      |
    | 59ab85d3-4425-423f-8e3b-b462d26f205e | Leia        |
    | 9504ccc6-2663-44e7-a783-c6838a0ae0c8 | Leia        |
    | b33dc068-8d87-4680-a1cb-d970dcf4a5a4 | Kenobi      |
    | 95dfccf9-c2ab-43ef-9aec-9006ad3d5579 | Kenobi      |
    | d9280b93-62e3-4e5f-935f-f37fb07161f6 | BobaFett    |
    | 903fde18-0078-4477-ac97-0ed0604f61fc | BobaFett    |
    | 9c07864f-542e-4af8-94c7-d1277a4de126 | R2-D2       |
    | d7bfc1a4-c0a2-468b-9159-4b9ad71cec82 | R2-D2       |
    | b3fefef2-2aed-4568-a3ff-f93ea501b2f8 | C-3PO       |
    | 9a0f3464-ce85-4334-8d0a-1f467c35a2fe | Ackbar      |
    | 2f17654f-b8f3-475b-958b-7af5ad740161 | Emperor     |
    | f8f0d0c5-2971-4cd2-ade5-6de2820b46d8 | Emperor     |
    | c9d20e39-4760-4da0-9697-433c65ddff82 | Lando       |
    | dfcd11d0-fadc-4067-8e1c-7a0d179d8c4f | Lando       |
    | f4e2e663-29bd-48d4-ae70-3c61410eb262 | Chewie      |
    | 950e960b-8eb5-480f-a1a9-6135b9ffaa84 | Chewie      |
    | ca5b2cfd-e716-438a-a62d-f7ec1ad92d5d | Tarkin      |
    | 776d4114-2a8e-43ec-8a19-9e52c75f1164 | Tarkin      |
    | 984747e1-5f34-466d-96b7-6eca54bc3a63 | Greedo      |
    | 9175c9cc-d0df-4914-8812-fa455c6f63dc | Sarlac      |
    | fc3b6789-909e-437c-806a-7c8d5a7a1f87 | Grievous    |
    | e28162d8-7f1a-4067-bbca-a26c5f8be708 | Dooku       |
    | 5eee4029-1871-46a3-98bf-1901dc492295 | Anakin      |
    | e5a1f209-ecf9-4820-ba54-3b7d437ce4df | DarthMaul   |
    | 51a73140-abac-4b25-9ffa-9a0a1d61ab85 | JarJar      |
    | 70aa1657-bcd1-42e5-8739-38b6e531ff23 | Padme       |
    | 49e69e47-2e65-4092-a3eb-3db48e428433 | Palpatine   |
    | 4cdcf634-108d-4e1d-b290-853a6b0fcd81 | MaceWindu   |
    | 8107e232-368c-400b-838e-679c1f5554bf | Qui-Gon     |
    | f4061f82-01bd-4602-977e-8c5d57e8c5b6 | JangoFett   |
    | 386d73df-0268-425c-bd68-c0165284d59e | BailOrgana  |
    | 83c3ffa2-fe77-4012-8fa9-fb466e88a8d7 | Sebulba     |
    | f64babff-de52-4075-81ce-3da215ad0a12 | Watto       |
    | 040bf56c-1b21-4f7d-8432-d4007288aed5 | Nute        |
    | d215015a-36f0-439e-a2c7-81ba1e9ebfd4 | Valorum     |
