TCL4 Data Management/main.html
<div id="outline-container-orgb645fd2" class="outline-2">
<h2 id="orgb645fd2"><span class="section-number-2">4</span> Data Integrity in TCL4</h2>
<div class="outline-text-2" id="text-4">
<p>
In order to provide data integrity for the vast amounts of data collected over the course of TCL4, we require the set of <code>(uss_name,call_sign)</code> pairs and the set of <code>(uvin,call_sign)</code> pairs to be pre-determined and immutable.  For the collaborative simulation, shakedown, and the primary demonstration, these pre-determined sets will be stated in this document and uploaded to this github directory.
</p>
</div>
<div id="outline-container-org6f2c2aa" class="outline-3">
<h3 id="org6f2c2aa"><span class="section-number-3">4.1</span> Collaborative Simulation</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Data can be found in the following files: 
<ul class="org-ul">
<li><code>NV-CollabSim-Sc2-USSClientId-CallSign_unique.csv</code></li>
<li><code>NV-CollabSim-Sc2-UVIN-CallSign.csv</code></li>
<li><code>NV-CollabSim-Sc4-USSClientId-CallSign_unique.csv</code></li>
<li><code>NV-CollabSim-Sc4-UVIN-CallSign.csv</code></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org50f60c1" class="outline-4">
<h4 id="org50f60c1"><span class="section-number-4">4.1.1</span> Scenario 2: <code>(uss_name,call_sign)</code></h4>
<div class="outline-text-4" id="text-4-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>uss_name</code></th>
<th scope="col" class="org-left"><code>call_sign</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Yoda</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Luke</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">HanSolo</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">DarthVader</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Jabba</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Wicket</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Leia</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Kenobi</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">BobaFett</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">R2-D2</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">C-3PO</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Ackbar</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Emperor</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Lando</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Chewie</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Tarkin</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Greedo</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Sarlac</td>
</tr>

<tr>
<td class="org-left">uss-dev.flyanra.net</td>
<td class="org-left">Grievous</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Dooku</td>
</tr>

<tr>
<td class="org-left">uss-dev.flyanra.net</td>
<td class="org-left">Anakin</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">DarthMaul</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">JarJar</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Padme</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Palpatine</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">MaceWindu</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Qui-Gon</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">JangoFett</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">BailOrgana</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Sebulba</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Watto</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Nute</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Valorum</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgce35077" class="outline-4">
<h4 id="orgce35077"><span class="section-number-4">4.1.2</span> Scenario 2: <code>(uvin,call_sign)</code></h4>
<div class="outline-text-4" id="text-4-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>uvin</code></th>
<th scope="col" class="org-left"><code>call_sign</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">155cd3bc-a70c-46ef-9020-e0c71ed4fc42</td>
<td class="org-left">Yoda</td>
</tr>

<tr>
<td class="org-left">0654918c-0d04-4219-805c-0b97560fc137</td>
<td class="org-left">Yoda</td>
</tr>

<tr>
<td class="org-left">068e2e34-d792-4c99-aab6-2631fe1987ca</td>
<td class="org-left">Luke</td>
</tr>

<tr>
<td class="org-left">33d38948-5695-44f9-ac51-6a566b37a362</td>
<td class="org-left">Luke</td>
</tr>

<tr>
<td class="org-left">e44db783-9059-4aba-b894-3e934498ce22</td>
<td class="org-left">HanSolo</td>
</tr>

<tr>
<td class="org-left">c8e163e2-ddcf-4bee-a1b6-894534c21996</td>
<td class="org-left">HanSolo</td>
</tr>

<tr>
<td class="org-left">a7fc22dc-70a7-428c-8f79-3f9ed0a7f855</td>
<td class="org-left">DarthVader</td>
</tr>

<tr>
<td class="org-left">fcb4c8b9-b384-4e27-8624-aebaf13d68bf</td>
<td class="org-left">DarthVader</td>
</tr>

<tr>
<td class="org-left">d378764f-63b5-4ee9-8413-c03b0de4281f</td>
<td class="org-left">Jabba</td>
</tr>

<tr>
<td class="org-left">47d996ea-f7e1-4ec5-ae3f-055dd8938101</td>
<td class="org-left">Wicket</td>
</tr>

<tr>
<td class="org-left">59ab85d3-4425-423f-8e3b-b462d26f205e</td>
<td class="org-left">Leia</td>
</tr>

<tr>
<td class="org-left">9504ccc6-2663-44e7-a783-c6838a0ae0c8</td>
<td class="org-left">Leia</td>
</tr>

<tr>
<td class="org-left">b33dc068-8d87-4680-a1cb-d970dcf4a5a4</td>
<td class="org-left">Kenobi</td>
</tr>

<tr>
<td class="org-left">95dfccf9-c2ab-43ef-9aec-9006ad3d5579</td>
<td class="org-left">Kenobi</td>
</tr>

<tr>
<td class="org-left">d9280b93-62e3-4e5f-935f-f37fb07161f6</td>
<td class="org-left">BobaFett</td>
</tr>

<tr>
<td class="org-left">903fde18-0078-4477-ac97-0ed0604f61fc</td>
<td class="org-left">BobaFett</td>
</tr>

<tr>
<td class="org-left">9c07864f-542e-4af8-94c7-d1277a4de126</td>
<td class="org-left">R2-D2</td>
</tr>

<tr>
<td class="org-left">d7bfc1a4-c0a2-468b-9159-4b9ad71cec82</td>
<td class="org-left">R2-D2</td>
</tr>

<tr>
<td class="org-left">b3fefef2-2aed-4568-a3ff-f93ea501b2f8</td>
<td class="org-left">C-3PO</td>
</tr>

<tr>
<td class="org-left">9a0f3464-ce85-4334-8d0a-1f467c35a2fe</td>
<td class="org-left">Ackbar</td>
</tr>

<tr>
<td class="org-left">2f17654f-b8f3-475b-958b-7af5ad740161</td>
<td class="org-left">Emperor</td>
</tr>

<tr>
<td class="org-left">f8f0d0c5-2971-4cd2-ade5-6de2820b46d8</td>
<td class="org-left">Emperor</td>
</tr>

<tr>
<td class="org-left">c9d20e39-4760-4da0-9697-433c65ddff82</td>
<td class="org-left">Lando</td>
</tr>

<tr>
<td class="org-left">dfcd11d0-fadc-4067-8e1c-7a0d179d8c4f</td>
<td class="org-left">Lando</td>
</tr>

<tr>
<td class="org-left">f4e2e663-29bd-48d4-ae70-3c61410eb262</td>
<td class="org-left">Chewie</td>
</tr>

<tr>
<td class="org-left">950e960b-8eb5-480f-a1a9-6135b9ffaa84</td>
<td class="org-left">Chewie</td>
</tr>

<tr>
<td class="org-left">ca5b2cfd-e716-438a-a62d-f7ec1ad92d5d</td>
<td class="org-left">Tarkin</td>
</tr>

<tr>
<td class="org-left">776d4114-2a8e-43ec-8a19-9e52c75f1164</td>
<td class="org-left">Tarkin</td>
</tr>

<tr>
<td class="org-left">984747e1-5f34-466d-96b7-6eca54bc3a63</td>
<td class="org-left">Greedo</td>
</tr>

<tr>
<td class="org-left">9175c9cc-d0df-4914-8812-fa455c6f63dc</td>
<td class="org-left">Sarlac</td>
</tr>

<tr>
<td class="org-left">fc3b6789-909e-437c-806a-7c8d5a7a1f87</td>
<td class="org-left">Grievous</td>
</tr>

<tr>
<td class="org-left">e28162d8-7f1a-4067-bbca-a26c5f8be708</td>
<td class="org-left">Dooku</td>
</tr>

<tr>
<td class="org-left">5eee4029-1871-46a3-98bf-1901dc492295</td>
<td class="org-left">Anakin</td>
</tr>

<tr>
<td class="org-left">e5a1f209-ecf9-4820-ba54-3b7d437ce4df</td>
<td class="org-left">DarthMaul</td>
</tr>

<tr>
<td class="org-left">51a73140-abac-4b25-9ffa-9a0a1d61ab85</td>
<td class="org-left">JarJar</td>
</tr>

<tr>
<td class="org-left">70aa1657-bcd1-42e5-8739-38b6e531ff23</td>
<td class="org-left">Padme</td>
</tr>

<tr>
<td class="org-left">49e69e47-2e65-4092-a3eb-3db48e428433</td>
<td class="org-left">Palpatine</td>
</tr>

<tr>
<td class="org-left">4cdcf634-108d-4e1d-b290-853a6b0fcd81</td>
<td class="org-left">MaceWindu</td>
</tr>

<tr>
<td class="org-left">8107e232-368c-400b-838e-679c1f5554bf</td>
<td class="org-left">Qui-Gon</td>
</tr>

<tr>
<td class="org-left">f4061f82-01bd-4602-977e-8c5d57e8c5b6</td>
<td class="org-left">JangoFett</td>
</tr>

<tr>
<td class="org-left">386d73df-0268-425c-bd68-c0165284d59e</td>
<td class="org-left">BailOrgana</td>
</tr>

<tr>
<td class="org-left">83c3ffa2-fe77-4012-8fa9-fb466e88a8d7</td>
<td class="org-left">Sebulba</td>
</tr>

<tr>
<td class="org-left">f64babff-de52-4075-81ce-3da215ad0a12</td>
<td class="org-left">Watto</td>
</tr>

<tr>
<td class="org-left">040bf56c-1b21-4f7d-8432-d4007288aed5</td>
<td class="org-left">Nute</td>
</tr>

<tr>
<td class="org-left">d215015a-36f0-439e-a2c7-81ba1e9ebfd4</td>
<td class="org-left">Valorum</td>
</tr>
</tbody>
</table>
</div>
</div>
