TCL4 Data Management/main.org
*** Scenario 4: =(uss_name,call_sign)=       
    | =uss_name=              | =call_sign=  |
    |-------------------------+--------------|
    | airxos.co               | JonSnow      |
    | uss.avisionrobotics.com | JonSnow      |
    | uber.com                | Daenerys     |
    | airxos.co               | Daenerys     |
    | airxos.co               | Cersei       |
    | uss.avisionrobotics.com | Cersei       |
    | airxos.co               | LittleFinger |
    | airxos.co               | Tyrion       |
    | airxos.co               | Eddard       |
    | uber.com                | Bran         |
    | uss.avisionrobotics.com | Sansa        |
    | airxos.co               | Arya         |
    | uss.avisionrobotics.com | Gendy        |
    | airxos.co               | Bronn        |
    | uber.com                | Oberyn       |
    | uss.avisionrobotics.com | Varys        |
    | airxos.co               | NightKing    |
    | uss.avisionrobotics.com | Tywin        |
    | airxos.co               | Stark        |
    | uss.airmap.com          | Lannister    |
    | airxos.co               | Baratheon    |
    | uss.airmap.com          | Targaryen    |
    | uss.airmap.com          | Frey         |
    | uss.airmap.com          | Tarly        |
    | uss.airmap.com          | Martell      |
    | uss.avisionrobotics.com | Bolton       |
    | uss.avisionrobotics.com | Whitewalker  |
    | uss.avisionrobotics.com | Tyrell       |
    | uss.avisionrobotics.com | Mormont      |
    | uber.com                | Greyjoy      |
    | uber.com                | Clegane      |
    | uber.com                | Arryn        |
    | uber.com                | Sand         |
*** Scenario 4: =(uvin,call_sign)=          
    | =uvin=                               | =call_sign=  |
    |--------------------------------------+--------------|
    | 91464982-c3f8-499e-8679-01e586ad65c9 | JonSnow      |
    | 65504a35-7d6d-4c74-98e2-50ad53c0634b | JonSnow      |
    | 5375f921-503a-40d8-9a90-0150fe191573 | Daenerys     |
    | 335639d6-68a6-490c-92ec-15f7f41690e6 | Daenerys     |
    | f82ccd50-d5eb-423c-93aa-a10c124feb0b | Cersei       |
    | 0ce11c80-aa19-4a8a-8c5a-b93e80fb8d11 | Cersei       |
    | a14c1c7a-79a9-4d41-ae24-2ba9e348582c | LittleFinger |
    | 83c7a7a7-a044-49f7-a661-c327c26cef58 | LittleFinger |
    | 5c8755c3-18e4-422d-8e8c-6cb23e0c02cc | Tyrion       |
    | 932c1fb9-066e-4385-94cf-6030f5cbe970 | Tyrion       |
    | 5d0622f4-3b9f-4c63-bde6-459436644789 | Eddard       |
    | 25ce6765-02da-498a-97ee-2ef2b56dfd19 | Eddard       |
    | 52b43eec-d64e-4309-b527-fdec3469f0e1 | Bran         |
    | ccdce87a-987c-493a-9c9e-2e9777367720 | Bran         |
    | ad761462-21f3-4965-8265-e002a3383432 | Sansa        |
    | 0c273002-dd84-4068-8f1e-e7c2108b7154 | Sansa        |
    | 674c5c89-47ec-4b92-b387-1e17d217f408 | Arya         |
    | 3c4e2d1a-9a02-412f-b4b6-0b2b1f472aaf | Arya         |
    | 3b5ea8d6-e14a-4d95-89cc-14402295d82e | Gendy        |
    | 3e1a2dca-104e-43ef-810f-4da52dfd11ce | Gendy        |
    | fb032d64-351a-42d5-8ccf-691db28bd343 | Bronn        |
    | bec982a6-020f-4322-9a0c-27cb1eec3e73 | Bronn        |
    | df80a061-1093-4e8e-9c78-b637c169f91d | Oberyn       |
    | 7741db09-87a1-4666-ab00-ba7245a29b51 | Oberyn       |
    | 276fafe4-d732-44cc-9345-a06a9b6444af | Varys        |
    | 7707e5ca-dbb3-4d36-bb44-a6ea0e44eadd | Varys        |
    | 7829a77d-7dca-4c68-a3f7-37d47be108c9 | NightKing    |
    | 522c903f-dc64-4922-8b6a-ed463dd0e43c | NightKing    |
    | 570dd10d-bf9d-409a-9fc4-b0641218b9bd | Tywin        |
    | bf410a44-a259-4985-b9c0-0a1a012a3308 | Tywin        |
    | 25ed7cfe-4086-4d9e-aaad-8e474cf2e67b | Stark        |
    | e74efb11-4988-4c10-93cc-298d202bce69 | Lannister    |
    | 6bd4d283-c2b1-400b-b407-c5933f474591 | Baratheon    |
    | 1d5e3bfc-f3bb-4e52-b42c-a460889424dd | Targaryen    |
    | fbe691c7-4ff3-45a8-8472-95f5e27c5d48 | Frey         |
    | 1d843c69-c278-447a-be20-51db4445cc2f | Tarly        |
    | eb2eaec0-4c74-474b-a548-24885698b04d | Martell      |
    | ac117712-c24d-4db9-9f0c-d958367bf8f8 | Bolton       |
    | 64903780-37fa-4907-876b-36bba7550460 | Whitewalker  |
    | 1f8a61b7-7879-476d-83c6-e3655de8988f | Tyrell       |
    | c7d2fd91-4656-41b5-80b7-2318e858464d | Mormont      |
    | 7ddf108d-db66-4414-a984-e67c91eac338 | Greyjoy      |
    | bbb9b2c5-c260-4733-8550-378b1352f02a | Clegane      |
    | 6228a46c-1cbb-422e-80d6-8702ffc332b8 | Arryn        |
    | 5491d035-05b1-4a8b-b3e3-3110ef880e15 | Sand         |
    

