TCL4 Data Management/main.html
<div id="outline-container-orgc01514d" class="outline-4">
<h4 id="orgc01514d"><span class="section-number-4">4.1.3</span> Scenario 4: <code>(uss_name,call_sign)</code></h4>
<div class="outline-text-4" id="text-4-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>uss_name</code></th>
<th scope="col" class="org-left"><code>call_sign</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">JonSnow</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">JonSnow</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Daenerys</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Daenerys</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Cersei</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Cersei</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">LittleFinger</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Tyrion</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Eddard</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Bran</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Sansa</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Arya</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Gendy</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Bronn</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Oberyn</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Varys</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">NightKing</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Tywin</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Stark</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Lannister</td>
</tr>

<tr>
<td class="org-left">airxos.co</td>
<td class="org-left">Baratheon</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Targaryen</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Frey</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Tarly</td>
</tr>

<tr>
<td class="org-left">uss.airmap.com</td>
<td class="org-left">Martell</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Bolton</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Whitewalker</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Tyrell</td>
</tr>

<tr>
<td class="org-left">uss.avisionrobotics.com</td>
<td class="org-left">Mormont</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Greyjoy</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Clegane</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Arryn</td>
</tr>

<tr>
<td class="org-left">uber.com</td>
<td class="org-left">Sand</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgca12a8f" class="outline-4">
<h4 id="orgca12a8f"><span class="section-number-4">4.1.4</span> Scenario 4: <code>(uvin,call_sign)</code></h4>
<div class="outline-text-4" id="text-4-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>uvin</code></th>
<th scope="col" class="org-left"><code>call_sign</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">91464982-c3f8-499e-8679-01e586ad65c9</td>
<td class="org-left">JonSnow</td>
</tr>

<tr>
<td class="org-left">65504a35-7d6d-4c74-98e2-50ad53c0634b</td>
<td class="org-left">JonSnow</td>
</tr>

<tr>
<td class="org-left">5375f921-503a-40d8-9a90-0150fe191573</td>
<td class="org-left">Daenerys</td>
</tr>

<tr>
<td class="org-left">335639d6-68a6-490c-92ec-15f7f41690e6</td>
<td class="org-left">Daenerys</td>
</tr>

<tr>
<td class="org-left">f82ccd50-d5eb-423c-93aa-a10c124feb0b</td>
<td class="org-left">Cersei</td>
</tr>

<tr>
<td class="org-left">0ce11c80-aa19-4a8a-8c5a-b93e80fb8d11</td>
<td class="org-left">Cersei</td>
</tr>

<tr>
<td class="org-left">a14c1c7a-79a9-4d41-ae24-2ba9e348582c</td>
<td class="org-left">LittleFinger</td>
</tr>

<tr>
<td class="org-left">83c7a7a7-a044-49f7-a661-c327c26cef58</td>
<td class="org-left">LittleFinger</td>
</tr>

<tr>
<td class="org-left">5c8755c3-18e4-422d-8e8c-6cb23e0c02cc</td>
<td class="org-left">Tyrion</td>
</tr>

<tr>
<td class="org-left">932c1fb9-066e-4385-94cf-6030f5cbe970</td>
<td class="org-left">Tyrion</td>
</tr>

<tr>
<td class="org-left">5d0622f4-3b9f-4c63-bde6-459436644789</td>
<td class="org-left">Eddard</td>
</tr>

<tr>
<td class="org-left">25ce6765-02da-498a-97ee-2ef2b56dfd19</td>
<td class="org-left">Eddard</td>
</tr>

<tr>
<td class="org-left">52b43eec-d64e-4309-b527-fdec3469f0e1</td>
<td class="org-left">Bran</td>
</tr>

<tr>
<td class="org-left">ccdce87a-987c-493a-9c9e-2e9777367720</td>
<td class="org-left">Bran</td>
</tr>

<tr>
<td class="org-left">ad761462-21f3-4965-8265-e002a3383432</td>
<td class="org-left">Sansa</td>
</tr>

<tr>
<td class="org-left">0c273002-dd84-4068-8f1e-e7c2108b7154</td>
<td class="org-left">Sansa</td>
</tr>

<tr>
<td class="org-left">674c5c89-47ec-4b92-b387-1e17d217f408</td>
<td class="org-left">Arya</td>
</tr>

<tr>
<td class="org-left">3c4e2d1a-9a02-412f-b4b6-0b2b1f472aaf</td>
<td class="org-left">Arya</td>
</tr>

<tr>
<td class="org-left">3b5ea8d6-e14a-4d95-89cc-14402295d82e</td>
<td class="org-left">Gendy</td>
</tr>

<tr>
<td class="org-left">3e1a2dca-104e-43ef-810f-4da52dfd11ce</td>
<td class="org-left">Gendy</td>
</tr>

<tr>
<td class="org-left">fb032d64-351a-42d5-8ccf-691db28bd343</td>
<td class="org-left">Bronn</td>
</tr>

<tr>
<td class="org-left">bec982a6-020f-4322-9a0c-27cb1eec3e73</td>
<td class="org-left">Bronn</td>
</tr>

<tr>
<td class="org-left">df80a061-1093-4e8e-9c78-b637c169f91d</td>
<td class="org-left">Oberyn</td>
</tr>

<tr>
<td class="org-left">7741db09-87a1-4666-ab00-ba7245a29b51</td>
<td class="org-left">Oberyn</td>
</tr>

<tr>
<td class="org-left">276fafe4-d732-44cc-9345-a06a9b6444af</td>
<td class="org-left">Varys</td>
</tr>

<tr>
<td class="org-left">7707e5ca-dbb3-4d36-bb44-a6ea0e44eadd</td>
<td class="org-left">Varys</td>
</tr>

<tr>
<td class="org-left">7829a77d-7dca-4c68-a3f7-37d47be108c9</td>
<td class="org-left">NightKing</td>
</tr>

<tr>
<td class="org-left">522c903f-dc64-4922-8b6a-ed463dd0e43c</td>
<td class="org-left">NightKing</td>
</tr>

<tr>
<td class="org-left">570dd10d-bf9d-409a-9fc4-b0641218b9bd</td>
<td class="org-left">Tywin</td>
</tr>

<tr>
<td class="org-left">bf410a44-a259-4985-b9c0-0a1a012a3308</td>
<td class="org-left">Tywin</td>
</tr>

<tr>
<td class="org-left">25ed7cfe-4086-4d9e-aaad-8e474cf2e67b</td>
<td class="org-left">Stark</td>
</tr>

<tr>
<td class="org-left">e74efb11-4988-4c10-93cc-298d202bce69</td>
<td class="org-left">Lannister</td>
</tr>

<tr>
<td class="org-left">6bd4d283-c2b1-400b-b407-c5933f474591</td>
<td class="org-left">Baratheon</td>
</tr>

<tr>
<td class="org-left">1d5e3bfc-f3bb-4e52-b42c-a460889424dd</td>
<td class="org-left">Targaryen</td>
</tr>

<tr>
<td class="org-left">fbe691c7-4ff3-45a8-8472-95f5e27c5d48</td>
<td class="org-left">Frey</td>
</tr>

<tr>
<td class="org-left">1d843c69-c278-447a-be20-51db4445cc2f</td>
<td class="org-left">Tarly</td>
</tr>

<tr>
<td class="org-left">eb2eaec0-4c74-474b-a548-24885698b04d</td>
<td class="org-left">Martell</td>
</tr>

<tr>
<td class="org-left">ac117712-c24d-4db9-9f0c-d958367bf8f8</td>
<td class="org-left">Bolton</td>
</tr>

<tr>
<td class="org-left">64903780-37fa-4907-876b-36bba7550460</td>
<td class="org-left">Whitewalker</td>
</tr>

<tr>
<td class="org-left">1f8a61b7-7879-476d-83c6-e3655de8988f</td>
<td class="org-left">Tyrell</td>
</tr>

<tr>
<td class="org-left">c7d2fd91-4656-41b5-80b7-2318e858464d</td>
<td class="org-left">Mormont</td>
</tr>

<tr>
<td class="org-left">7ddf108d-db66-4414-a984-e67c91eac338</td>
<td class="org-left">Greyjoy</td>
</tr>

<tr>
<td class="org-left">bbb9b2c5-c260-4733-8550-378b1352f02a</td>
<td class="org-left">Clegane</td>
</tr>

<tr>
<td class="org-left">6228a46c-1cbb-422e-80d6-8702ffc332b8</td>
<td class="org-left">Arryn</td>
</tr>

<tr>
<td class="org-left">5491d035-05b1-4a8b-b3e3-3110ef880e15</td>
<td class="org-left">Sand</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-03-15</p>
<p class="author">Author: Abraham K. Ishihara</p>
<p class="date">Created: 2019-04-16 Tue 21:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>